БухЭксп/Catalogs/CW_ВебПрофилиПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПрофилиПеревозок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВебПрофили</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПереводитьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВыводНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОсновногоОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПереводаВАрхив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПереводаВАрхив</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТипФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПрикреплятьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАрхива</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрофиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебШаблоныПрофилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВебПрофили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВебПрофили</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПереводитьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенВыводНаАнглийскомЯзыке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОсновногоОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтбораДокументов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПрофиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебПрофили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПереводаВАрхив</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрПереводаВАрхив</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНаАнглийском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНаРусском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьФинансовыеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектПечатныхФорм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_КомплектыПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДополнительнойИнформации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТипФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноПрикреплятьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАрхивныхГрузоперевозок</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенРазделЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноСозданиеЗавок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенРазделПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПрофиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВебШаблоныПрофилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеRU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеEN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтбораОтчетЗадоженность</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенРазделОтчеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуемыйВариантОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПрофиля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектХарактеристики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фиксация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВариантыФиксацииКолонок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БыстрыйОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенФормат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыФайлов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоляСортировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПоляКомпоновки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сортировка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокСортировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныЗаявок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ВебШаблоныЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресУведомлений</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонПисьма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Используется</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВариантыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_ОбщийМодульЛичныйКабинетСервер/Ext/Module.bsl
Процедура ПолучитьШаблоныТекстовHTTPЗапросов(Результат) Экспорт
	
	Результат.Вставить("lkk_updateuser", 		"/%1/hs/lkk/updateuser");  
	Результат.Вставить("lkk_activeusers", 		"/%1/hs/lkk/activeusers"); 
	Результат.Вставить("lkk_userinfo", 			"/%1/hs/lkk/userinfo");  
	Результат.Вставить("lkk_deluser", 			"/%1/hs/lkk/deluser"); 
	Результат.Вставить("lkk_reginfo", 			"/%1/hs/lkk/reginfo");  
	Результат.Вставить("lkk_parametersinfo", 	"/%1/hs/lkk/parametersinfo");  
	Результат.Вставить("lkk_activationservice", "/%1/hs/lkk/activationservice");
	Результат.Вставить("lkk_disableservice",	"/%1/hs/lkk/disableservice");  
	Результат.Вставить("lkk_sendpassword",		"/%1/hs/lkk/sendpassword");   
	Результат.Вставить("lkk_setlogo",			"/%1/hs/lkk/setlogo");
	Результат.Вставить("lkk_dellogo",			"/%1/hs/lkk/dellogo");
	Результат.Вставить("lkk_sendinvitation",	"/%1/hs/lkk/sendinvitation");  
	Результат.Вставить("lkk_statistics",		"/%1/hs/lkk/statistics");
	Результат.Вставить("lkk_changeparameters", 	"/%1/hs/lkk/changeparameters");
	Результат.Вставить("lkk_changecontacts",	"/%1/hs/lkk/changecontacts"); 
	Результат.Вставить("lkk_changedisplayname",	"/%1/hs/lkk/changedisplayname"); 
	Результат.Вставить("lkk_taskssending",		"/%1/hs/lkk/taskssending");  
	Результат.Вставить("lkk_savetasks",			"/%1/hs/lkk/savetasks");   
	Результат.Вставить("lkk_runtasks",			"/%1/hs/lkk/runtasks");
	Результат.Вставить("lkk_checkaccess", 		"/%1/hs/lkk/checkaccess");   
	Результат.Вставить("lkk_lkkinfo",			"/%1/hs/lkk/lkkinfo");    
	Результат.Вставить("lkk_autoinvoice",		"/%1/hs/lkk/autoinvoice");  
	Результат.Вставить("lkk_changemail",		"/%1/hs/lkk/changemail");  
	Результат.Вставить("lkk_testmail",			"/%1/hs/lkk/testmail");  
	Результат.Вставить("lkk_saveaccount",		"/%1/hs/lkk/saveaccount");  
	
КонецПроцедуры

//Перевод в архив
Процедура ПереводГрузоперевозокВАрхив(ПараметрыПроцедуры = Неопределено, АдресРезультата= Неопределено) Экспорт
	
	мПрофили = Новый Массив;
	ПеревестиГрузоперевозокиВАрхив(мПрофили);
	
КонецПроцедуры

Процедура ПеревестиГрузоперевозокиВАрхив(мПрофили) Экспорт
	
	УстановленОтборПоПрофлям = мПрофили.Количество() <> 0; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мПрофили", мПрофили);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПрофилиПеревозок.Ссылка КАК Ссылка,
	               |	CW_ВебПрофилиПеревозок.НастройкиОсновногоОтбора КАК НастройкиОсновногоОтбора,
	               |	CW_ВебПрофилиПеревозок.ПараметрПереводаВАрхив КАК ПараметрПереводаВАрхив,
	               |	CW_ВебПрофилиПеревозок.ПараметрПереводаВАрхив.ЭтоКонтрольнаяДата КАК ПараметрКонтрольнаяДата,
	               |	CW_ВебПрофилиПеревозок.ОтсрочкаПереводаВАрхив КАК Дни,
	               |	CW_ВебПрофилиПеревозок.ИдентификаторАрхива КАК ИдентификаторАрхива
	               |ИЗ
	               |	Справочник.CW_ВебПрофилиПеревозок КАК CW_ВебПрофилиПеревозок
	               |ГДЕ
	               |	CW_ВебПрофилиПеревозок.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ВебПрофилиПеревозок.Активный = ИСТИНА
	               |	И CW_ВебПрофилиПеревозок.АвтоматическиПереводитьВАрхив = ИСТИНА
           		   |	//ОтборПрофилей"; 

	Если УстановленОтборПоПрофлям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//ОтборПрофилей", " И CW_ВебПрофилиПеревозок.Ссылка В(&мПрофили)"); 
	КонецЕсли;
	
	Выборка = запрос.Выполнить().Выбрать();
	
	мГрузоперевозокиДляПереводаВАрхив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СКД = Справочники.CW_ВебПрофили.ПолучитьМакет("СхемаПараметров");
	
		СтрокаПоляКомпоновки = "Ссылка."+Выборка.ПараметрПереводаВАрхив.Идентификатор;
		Если Выборка.ПараметрКонтрольнаяДата Тогда
			СтрокаПоляКомпоновки = СтрокаПоляКомпоновки + "_ЗначениеФакт";
		КонецЕсли;
		ИмяПоляКомпоновки = СокрЛП(Новый ПолеКомпоновкиДанных(СтрокаПоляКомпоновки));
		
		НастройкиОсновногоОтбора	= Выборка.НастройкиОсновногоОтбора.Получить();
		
		НастройкиКомпоновкиДанных 	= СКД.НастройкиПоУмолчанию;
		
		ТаблицаЗначений = Новый ТаблицаЗначений;    
		ПроцессорВыводаВКоллекциюЗначений = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
		ПроцессорВыводаВКоллекциюЗначений.УстановитьОбъект(ТаблицаЗначений);    
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		
		КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
		
		ВычисляемоеПоле = СКД.ВычисляемыеПоля.Добавить();
		ВычисляемоеПоле.ПутьКДанным = 	"КонтрольнаяДата";
		ВычисляемоеПоле.Выражение 	= 	"ВЫБОР КОГДА ISNULL("+ИмяПоляКомпоновки+", ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1) ТОГДА
										| ДАТАВРЕМЯ(1,1,1)
										|ИНАЧЕ
										|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ISNULL("+ИмяПоляКомпоновки+", ДАТАВРЕМЯ(1,1,1)) , ""ДЕНЬ"", "+Формат(Выборка.Дни,"ЧДЦ=0; ЧН=0; ЧГ=")+ "), ""ДЕНЬ"")
										|КОНЕЦ";
		
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок 	= "Ссылка";
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("Ссылка");
		НовоеПоле.Использование = Истина;
		
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок 	= ИмяПоляКомпоновки;
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных(СтрокаПоляКомпоновки);
		НовоеПоле.Использование = Истина;
		
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок 	= "КонтрольнаяДата";
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("КонтрольнаяДата");
		НовоеПоле.Использование = Истина;
		
		НастройкиОсновногоОтбора = Выборка.НастройкиОсновногоОтбора.Получить();
		Если НастройкиОсновногоОтбора <> Неопределено Тогда
			Для Каждого ЭлементОтбора Из НастройкиОсновногоОтбора.Отбор.Элементы Цикл
				ЭлементОтбораСКД = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(ЭлементОтбораСКД, ЭлементОтбора);
			КонецЦикла;
		КонецЕсли;  

		ГруппаОтбораИ = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаОтбораИ.Использование = Истина;
		
		ЭлементОтбораСКД = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("КонтрольнаяДата");
		ЭлементОтбораСКД.ВидСравнения 	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбораСКД.ПравоеЗначение = НачалоДня(ТекущаяДата());
		
		ЭлементОтбораСКД = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(СтрокаПоляКомпоновки);
		ЭлементОтбораСКД.ВидСравнения 	= ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбораСКД.ПравоеЗначение = Дата(1,1,1);
		
		ГруппаОтбораИЛИ = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		ГруппаОтбораИЛИ.Использование = Истина;
		
		ЭлементОтбораСКД = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+Выборка.ИдентификаторАрхива.Идентификатор);
		ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбораСКД.ПравоеЗначение = Истина;
		
		ЭлементОтбораСКД = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+Выборка.ИдентификаторАрхива.Идентификатор);
		ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		ЭлементОтбораСКД = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+Выборка.ИдентификаторАрхива.Идентификатор);
		ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораСКД.ПравоеЗначение = null;
	
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД,КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;    
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
		
		ТаблицаГрузоперевозок = ПроцессорВыводаВКоллекциюЗначений.Вывести(ПроцессорКомпоновкиДанных);
		
		//Перевод в архив
		Для Каждого СтрокаТаблицы из ТаблицаГрузоперевозок Цикл
			
			ТГрузоперевозка	= СтрокаТаблицы.Ссылка.ПолучитьОбъект(); 
			ПараметрыОтбора = Новый Структура("Параметр", Выборка.ИдентификаторАрхива);
			
			мСтроки = ТГрузоперевозка.ПараметрыГрузоперевозки.НайтиСтроки(ПараметрыОтбора); 
			Если мСтроки.Количество() > 0 Тогда
				СтрокаПараметров = мСтроки[0];
				СтрокаПараметров.Значение = истина;
			Иначе
				СтрокаПараметров 			= ТГрузоперевозка.ПараметрыГрузоперевозки.Добавить();
				СтрокаПараметров.Параметр 	= Выборка.ИдентификаторАрхива;
				СтрокаПараметров.Значение 	= истина;
			КонецЕсли;
			
			ТГрузоперевозка.Записать();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПереводЗаявокВАрхив(ПараметрыПроцедуры = Неопределено, АдресРезультата= Неопределено) Экспорт

	мПрофили = Новый Массив;
	ПеревестиЗаявкиВАрхив(мПрофили);

КонецПроцедуры  

Процедура ПеревестиЗаявкиВАрхив(мПрофили) Экспорт
	
	УстановленОтборПоПрофлям = мПрофили.Количество() <> 0; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мПрофили", мПрофили);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВебПрофилиЗаявок.Ссылка КАК Ссылка,
	               |	CW_ВебПрофилиЗаявок.НастройкиОсновногоОтбора КАК НастройкиОсновногоОтбора,
	               |	CW_ВебПрофилиЗаявок.ПараметрПереводаВАрхив КАК ПараметрПереводаВАрхив,
	               |	CW_ВебПрофилиЗаявок.ПараметрПереводаВАрхив.ЭтоКонтрольнаяДата КАК ПараметрКонтрольнаяДата,
	               |	CW_ВебПрофилиЗаявок.ОтсрочкаПереводаВАрхив КАК Дни,
	               |	CW_ВебПрофилиЗаявок.ИдентификаторАрхива КАК ИдентификаторАрхива
	               |ИЗ
	               |	Справочник.CW_ВебПрофилиЗаявок КАК CW_ВебПрофилиЗаявок
	               |ГДЕ
	               |	CW_ВебПрофилиЗаявок.ПометкаУдаления = ЛОЖЬ
	               |	И CW_ВебПрофилиЗаявок.Активный = ИСТИНА
	               |	И CW_ВебПрофилиЗаявок.АвтоматическиПереводитьВАрхив = ИСТИНА
           		   |	//ОтборПрофилей"; 

	Если УстановленОтборПоПрофлям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//ОтборПрофилей", " И CW_ВебПрофилиЗаявок.Ссылка В(&мПрофили)"); 
	КонецЕсли;
	
	Выборка = запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СКД = ПолучитьОбщийМакет("CW_ЗаявкиСхемаПараметров");
	
		СтрокаПоляКомпоновки = "Ссылка."+Выборка.ПараметрПереводаВАрхив.Идентификатор;
		Если Выборка.ПараметрКонтрольнаяДата Тогда
			СтрокаПоляКомпоновки = СтрокаПоляКомпоновки + "_ЗначениеФакт";
		КонецЕсли;
		ИмяПоляКомпоновки = СокрЛП(Новый ПолеКомпоновкиДанных(СтрокаПоляКомпоновки));
		
		НастройкиКомпоновкиДанных = СКД.НастройкиПоУмолчанию;   
		
		ТаблицаЗначений = Новый ТаблицаЗначений;    
		ПроцессорВыводаВКоллекциюЗначений = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;    
		ПроцессорВыводаВКоллекциюЗначений.УстановитьОбъект(ТаблицаЗначений);    
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		
		КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
		
		ВычисляемоеПоле = СКД.ВычисляемыеПоля.Добавить();
		ВычисляемоеПоле.ПутьКДанным = 	"КонтрольнаяДата";
		ВычисляемоеПоле.Выражение 	= 	"ВЫБОР КОГДА ISNULL("+ИмяПоляКомпоновки+", ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1) ТОГДА
										| ДАТАВРЕМЯ(1,1,1)
										|ИНАЧЕ
										|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ISNULL("+ИмяПоляКомпоновки+", ДАТАВРЕМЯ(1,1,1)) , ""ДЕНЬ"", "+Формат(Выборка.Дни,"ЧДЦ=0; ЧН=0; ЧГ=")+ "), ""ДЕНЬ"")
										|КОНЕЦ";
		
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок 	= "Ссылка";
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("Ссылка");
		НовоеПоле.Использование = Истина;
		
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок 	= ИмяПоляКомпоновки;
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных(СтрокаПоляКомпоновки);
		НовоеПоле.Использование = Истина;
		
		НовоеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		НовоеПоле.Заголовок 	= "КонтрольнаяДата";
		НовоеПоле.Поле 			= Новый ПолеКомпоновкиДанных("КонтрольнаяДата");
		НовоеПоле.Использование = Истина;
		
		НастройкиОсновногоОтбора = Выборка.НастройкиОсновногоОтбора.Получить();
		Если НастройкиОсновногоОтбора <> Неопределено Тогда
			Для Каждого ЭлементОтбора Из НастройкиОсновногоОтбора.Отбор.Элементы Цикл
				ЭлементОтбораСКД = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(ЭлементОтбораСКД, ЭлементОтбора);
			КонецЦикла;
		КонецЕсли;  

		ГруппаОтбораИ = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаОтбораИ.Использование = Истина;
		
		ЭлементОтбораСКД = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("КонтрольнаяДата");
		ЭлементОтбораСКД.ВидСравнения 	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбораСКД.ПравоеЗначение = НачалоДня(ТекущаяДата());
		
		ЭлементОтбораСКД = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(СтрокаПоляКомпоновки);
		ЭлементОтбораСКД.ВидСравнения 	= ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбораСКД.ПравоеЗначение = Дата(1,1,1);
		
		ГруппаОтбораИЛИ = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		ГруппаОтбораИЛИ.Использование = Истина;
		
		ЭлементОтбораСКД = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+Выборка.ИдентификаторАрхива.Идентификатор);
		ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбораСКД.ПравоеЗначение = Истина;
		
		ЭлементОтбораСКД = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+Выборка.ИдентификаторАрхива.Идентификатор);
		ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		ЭлементОтбораСКД = ГруппаОтбораИЛИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораСКД.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка."+Выборка.ИдентификаторАрхива.Идентификатор);
		ЭлементОтбораСКД.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбораСКД.ПравоеЗначение = null;
	
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД,КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;    
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
		
		ТаблицаЗаявок = ПроцессорВыводаВКоллекциюЗначений.Вывести(ПроцессорКомпоновкиДанных);
		
		//Перевод в архив
		Для Каждого Заявка из ТаблицаЗаявок Цикл
			ТЗаявка	= Заявка.ПолучитьОбъект(); 
			ПараметрыОтбора = Новый Структура("Параметр", Выборка.ИдентификаторАрхива);
			
			мСтроки = ТЗаявка.ПараметрыЗаявки.НайтиСтроки(ПараметрыОтбора); 
			Если мСтроки.Количество() > 0 Тогда
				СтрокаПараметров = мСтроки[0];
				СтрокаПараметров.Значение 	= истина;
			Иначе
				СтрокаПараметров 			= Заявка.ПараметрыЗаявки.Добавить();
				СтрокаПараметров.Параметр 	= Выборка.ИдентификаторАрхива;
				СтрокаПараметров.Значение 	= истина;
			КонецЕсли;
			ТЗаявка.Записать();
		КонецЦикла;
		//Перевод в архив
	
	КонецЦикла;
	
КонецПроцедуры
//Перевод в архив


Функция ПолучитьИнформациюЛичногоКабинета(ПолучитьЛоготип = Ложь, УникальныйИдентифкатор=Неопределено) Экспорт
	
	СервисДоступен 		= Ложь;
	МассивОрганизаций 	= новый Массив;
	ДанныеУчетнойЗаписи = новый Структура;
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber", XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("getlogo", 	XMLСтрока(ПолучитьЛоготип));      
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_reginfo", СтруктураJSON);
	
	Если ПараметрыHTTPЗапроса.УказаныРегистрационныеДанные Тогда
		
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET"); 
		Если Ответ = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		СервисДоступен = Ответ.КодСостояния = 200;
		Если СервисДоступен Тогда  
			
			СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
			
			regnumber 		= XMLЗначение(тип("Строка"), 	СтруктураJSON.regnumber);
			currentrate		= XMLЗначение(тип("Строка"), 	СтруктураJSON.currentrate);
			startdate 		= XMLЗначение(тип("Дата"), 		СтруктураJSON.startdate);
			enddate 		= XMLЗначение(тип("Дата"), 		СтруктураJSON.enddate);
			startdateaf		= XMLЗначение(тип("Дата"), 		СтруктураJSON.startdateaf);
			enddateaf 		= XMLЗначение(тип("Дата"), 		СтруктураJSON.enddateaf);
			userslimit 		= XMLЗначение(тип("Число"), 	СтруктураJSON.userslimit);
			userstotal 		= XMLЗначение(тип("Число"), 	СтруктураJSON.userstotal);
			allowed 		= XMLЗначение(тип("Булево"), 	СтруктураJSON.allowed);
			clientempty		= XMLЗначение(тип("Булево"), 	СтруктураJSON.clientempty);
			withoutpay 		= XMLЗначение(тип("Булево"), 	СтруктураJSON.withoutpay);     
			
			name 		= XMLЗначение(тип("Строка"), 	СтруктураJSON.name);
			nameen 		= XMLЗначение(тип("Строка"), 	СтруктураJSON.nameen);
			phone 		= XMLЗначение(тип("Строка"), 	СтруктураJSON.phone);
			website 	= XMLЗначение(тип("Строка"), 	СтруктураJSON.website);
			email 		= XMLЗначение(тип("Строка"), 	СтруктураJSON.email);
			emailowner 	= XMLЗначение(тип("Строка"), 	СтруктураJSON.emailowner); 
			
			displayname	= XMLЗначение(тип("Строка"), 	СтруктураJSON.displayname);
			timezone 	= XMLЗначение(тип("Строка"), 	СтруктураJSON.timezone);
			Если Не ПустаяСтрока(timezone) Тогда
				ЧасовойПоясПредставление = "("+ПредставлениеЧасовогоПояса(timezone)+") "+СокрЛП(timezone);
			КонецЕсли;  
			
			ДанныеУчетнойЗаписи  = CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтруктураJSON.mailaccount);
			
			МассивОрганизаций = СтруктураJSON.allowedorganization; 
			
			Если СтруктураJSON.Свойство("logo") Тогда   
				Если ПустаяСтрока(СтруктураJSON.logo.data) Тогда
					АдресЛоготипа = "";
				Иначе
					ДвоичныеДанные 	= Base64Значение(СтруктураJSON.logo.data);
					АдресЛоготипа 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентифкатор);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;   
	
	РазрешенныеОрганизации = Новый Массив;
	Для Каждого idОрганизации из МассивОрганизаций Цикл
		ОрганизацияСсылка = Справочники.Организации.ПолучитьСсылку(XMLЗначение(Тип("УникальныйИдентификатор"), idОрганизации));
		ОрганизацияОбъект = ОрганизацияСсылка.ПолучитьОбъект();
		Если ОрганизацияОбъект <> Неопределено Тогда
			РазрешенныеОрганизации.Добавить(ОрганизацияСсылка);	
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ЛогинУказан", 			ПараметрыHTTPЗапроса.УказаныРегистрационныеДанные );
	Результат.Вставить("РегНомер", 				regnumber);
	Результат.Вставить("ТекущийТариф", 			currentrate);
	Результат.Вставить("ДатаНачала",			startdate);
	Результат.Вставить("ДатаОкончания",			enddate);
	Результат.Вставить("ДатаНачалаAF",			startdateaf);
	Результат.Вставить("ДатаОкончанияAF",		enddateaf);
	Результат.Вставить("ЛимитПользователей", 	userslimit);
	Результат.Вставить("ВсегоПользователей", 	userstotal); 
	Результат.Вставить("Разрешено", 			allowed); 
	
	Результат.Вставить("КлиентПустой", 			clientempty);
	Результат.Вставить("СервисДоступен", 		СервисДоступен);
	Результат.Вставить("БезОплаты", 			withoutpay);
	Результат.Вставить("АдресЛоготипа", 		АдресЛоготипа);
	
	Результат.Вставить("ЧасовойПояс", 				timezone);
	Результат.Вставить("ЧасовойПоясПредставление",	ЧасовойПоясПредставление);
	
	Результат.Вставить("НазваниеКомпании", 		name);
	Результат.Вставить("НазваниеКомпанииАнгл", 	nameen);
	Результат.Вставить("Сайт", 					website);
	Результат.Вставить("Телефоны", 				phone);
	Результат.Вставить("ЭлектроннаяПочта", 					email);
	Результат.Вставить("ЭлектроннаяПочтаДляРегистрации",	emailowner);  
	Результат.Вставить("ОтображаемоеИмяАдресаПриРассылке",	displayname);  
	
	Результат.Вставить("РазрешенныеОрганизации", РазрешенныеОрганизации);
	Результат.Вставить("ДанныеУчетнойЗаписи", 	 ДанныеУчетнойЗаписи); 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПредставлениеЧасовгоПояса(ЧасовойПояс) Экспорт
	
	Если Не ЗначениеЗаполнено(ЧасовойПояс) тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "("+ПредставлениеЧасовогоПояса(ЧасовойПояс)+") "+ЧасовойПояс;
	
КонецФункции


Функция ПроверитьВозможностьРаботыВСервисе() Экспорт
	
	РегистрационныйНомер 		= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber", 	XMLСтрока(РегистрационныйНомер)); 

	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_checkaccess", СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");
	Если Ответ = Неопределено Тогда  
		ВызватьИсключение "Отсутствует соединение с интернетом";
	КонецЕсли;
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
	
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния", 	Ответ.КодСостояния);
	Результат.Вставить("Описание", 		XMLЗначение(Тип("Строка"), СтруктураJSON.info));
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьОбновитьПользователяЛичногоКабинета() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЛогинПароль = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьЛогинПарольПользователя();
	Если Не ЗначениеЗаполнено(ЛогинПароль.Логин) 
		или Не ЗначениеЗаполнено(ЛогинПароль.Пароль) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Пользователь = Справочники.Пользователи.ПустаяСсылка();
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ЛогинПароль.Логин);
	Если ПользовательИБ <> Неопределено Тогда
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);
	КонецЕсли;
	
	СоздатьПользователя = Ложь;
	Если Пользователь.Пустая() Тогда
		Если ПользовательИБ <> Неопределено Тогда
			ПользовательИБ.Удалить();
		КонецЕсли;
		СоздатьПользователя = Истина;
	КонецЕсли;
	
	ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
	ОписаниеПользователяИБ.Имя 							= ЛогинПароль.Логин;
	ОписаниеПользователяИБ.ПолноеИмя 					= ЛогинПароль.Логин;
	ОписаниеПользователяИБ.АутентификацияСтандартная 	= Истина;
	ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль	 	= Истина;
	ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль	 	= Истина;
	ОписаниеПользователяИБ.Пароль	 					= ЛогинПароль.Пароль;
	
	мРоли = Новый Массив;
	мРоли.Добавить("БухгалтерияЭкспедитора");
	мРоли.Добавить("БухгалтерияЭкспедитораВнешнееСоединение");
	
	ОписаниеПользователяИБ.Вставить("Роли", мРоли);
	
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	
	Если СоздатьПользователя Тогда
		СпрПользователи = Справочники.Пользователи.СоздатьЭлемент();
	Иначе
		СпрПользователи = Пользователь.ПолучитьОбъект();
	КонецЕсли;

	СпрПользователи.Наименование 	= ЛогинПароль.Логин;
	СпрПользователи.Служебный 		= истина;
	
	СпрПользователи.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", 		ОписаниеПользователяИБ);
	СпрПользователи.ДополнительныеСвойства.Вставить("ПривелигированныйРежимЗаписи", Истина);
	
	СпрПользователи.Записать();
	
	Возврат истина;
			
КонецФункции


Функция ПроверитьРазмерФайлаЛоготипа(АдресХранилища) Экспорт
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	Возврат ДвоичныеДанные.Размер() > 102400;
		
КонецФункции

Функция ПолучитьЗначениеИменованногоЭлемента(XMLЭлемент, XMLИмяАтрибута, XMLТип) Экспорт
	
	XMLАтрибут = XMLЭлемент.Атрибуты.ПолучитьИменованныйЭлемент(XMLИмяАтрибута);
	
	Возврат ?(XMLАтрибут=Неопределено, Неопределено, XMLЗначение(XMLТип, XMLАтрибут.Значение));
	
КонецФункции

	
Процедура ОтправитьПользователюПароль(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();

	СтруктураJSON = Новый Структура;	
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("userid", 	XMLСтрока(ПараметрыПроцедуры.ИдентифкаторПользователя));
	СтруктураJSON.Вставить("email",		XMLСтрока(ПараметрыПроцедуры.ЭлектроннаяПочта));   
	СтруктураJSON.Вставить("requirepasswordchange", XMLСтрока(Истина));   
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_sendpassword", СтруктураJSON);

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Отсутствует соединение с интернетом";
	КонецЕсли;
	
	Если Ответ.КодСостояния <> 200 Тогда
		СоответствиеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
		ОписаниеОшибки = СоответствиеКодовСостояний.Получить(Ответ.КодСостояния);	
		ВызватьИсключение "Код состояния: " + Ответ.КодСостояния + " - " + ОписаниеОшибки;
	КонецЕсли;    
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);	
	
	Если СтруктураJSON.Свойство("error") Тогда
		ТекстОщибки = XMLЗначение(тип("Строка"),	СтруктураJSON.error);  
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния",		Ответ.КодСостояния);
	Результат.Вставить("ОшибкаОтправки", 	ЗначениеЗаполнено(ТекстОщибки));
	Результат.Вставить("ТекстОшибки", 		ТекстОщибки);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		
КонецПроцедуры
	
Процедура ОтправитьПользователюПриглашение(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("userid", 	XMLСтрока(ПараметрыПроцедуры.ИдентифкаторПользователя));
	СтруктураJSON.Вставить("email",		XMLСтрока(ПараметрыПроцедуры.ЭлектроннаяПочта));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_sendinvitation", СтруктураJSON);

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Отсутствует интернет-соединение";
	КонецЕсли;
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);      
	Если Ответ.КодСостояния <> 200 Тогда
		СоответствиеКодовСостояний = CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
		ОписаниеОшибки = СоответствиеКодовСостояний.Получить(Ответ.КодСостояния);	
		ВызватьИсключение "Код состояния: " + Ответ.КодСостояния + " - " + ОписаниеОшибки;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если СтруктураJSON.Свойство("error") Тогда
		ТекстОшибки = XMLЗначение(тип("Строка"),	СтруктураJSON.error);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния",		Ответ.КодСостояния);
	Результат.Вставить("ОшибкаОтправки", 	ЗначениеЗаполнено(ТекстОшибки));
	Результат.Вставить("ТекстОшибки", 		ТекстОшибки);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		
КонецПроцедуры

//Фоновая отмена счетов
Процедура ВыполнитьОтменуСчетов(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	МассивJSON = Новый Массив;
	Для каждого СтрокаТаблицы из ПараметрыПроцедуры.ТаблицаСчетов Цикл
		МассивJSON.Добавить(XMLСтрока(СтрокаТаблицы.ИдентифкаторСчета));
	КонецЦикла;   
	
	СтруктураJSON = Новый Структура;   
	СтруктураJSON.Вставить("NotifyCRM", Истина);

	СтруктураРегНомера = Новый Структура;
	СтруктураРегНомера.Вставить(XMLСтрока(СокрЛП("_"+ПараметрыПроцедуры.РегистрационныйНомер)), МассивJSON); 
	
	СтруктураJSON.Вставить("regnumbers", СтруктураРегНомера);
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_cancelinvoices", СтруктураJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	Если Ответ = Неопределено Тогда
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	Иначе   
		КодСостояния	= Ответ.КодСостояния;
		Если Ответ.КодСостояния <> 200 Тогда
			ТекстСостояния 	= Ответ.ПолучитьТелоКакСтроку();
		КонецЕсли;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния",	КодСостояния);
	СтруктураОтвета.Вставить("ТекстСостояния",	ТекстСостояния);
	
	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезультата);
			
КонецПроцедуры

//Фоновая получение печатной счета
Процедура ПолучитьПечатнуюФормуСчета(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	Документ = Новый Структура;
	Документ.Вставить("id", 	XMLСтрока(ПараметрыПроцедуры.ИдентифкаторСчета));
	Документ.Вставить("type", 	XMLСтрока(0));

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(ПараметрыПроцедуры.РегистрационныйНомер)); 
	СтруктураJSON.Вставить("email",		XMLСтрока(ПараметрыПроцедуры.Адрес)); 
	СтруктураJSON.Вставить("doc",		Документ); 
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_printing", СтруктураJSON);

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST"); 
	
	Если Ответ = Неопределено Тогда  
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	Иначе
		КодСостояния	= Ответ.КодСостояния;
		ТекстСостояния 	= Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния",	КодСостояния);
	СтруктураОтвета.Вставить("ТекстСостояния",	ТекстСостояния);
	
	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезультата);
			
КонецПроцедуры

//Фоновая получение печатной акта
Процедура ПолучитьПечатнуюФормуАкта(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	Документ = Новый Структура;
	Документ.Вставить("id", 	XMLСтрока(ПараметрыПроцедуры.ИдентифкаторСчета));
	Документ.Вставить("type", 	XMLСтрока(1));

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(ПараметрыПроцедуры.РегистрационныйНомер)); 
	СтруктураJSON.Вставить("email",		XMLСтрока(ПараметрыПроцедуры.Адрес)); 
	СтруктураJSON.Вставить("doc",		Документ); 
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_printing", СтруктураJSON);

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST"); 
	
	Если Ответ = Неопределено Тогда  
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	Иначе
		КодСостояния	= Ответ.КодСостояния;
		ТекстСостояния 	= Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния",	КодСостояния);
	СтруктураОтвета.Вставить("ТекстСостояния",	ТекстСостояния);
	
	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезультата);
			
КонецПроцедуры

Процедура ПолучитьСчетНаПродлениеПодписки(ПараметрыПроцедуры, АдресРезультата) Экспорт
	                            
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("software",		XMLСтрока(ПараметрыПроцедуры.ПрограммныйПродукт));
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(ПараметрыПроцедуры.РегистрационныйНомер));
	СтруктураJSON.Вставить("partnercode",	XMLСтрока(ПараметрыПроцедуры.КодПартнера));

	СтруктураJSON.Вставить("rateid",		XMLСтрока(ПараметрыПроцедуры.ИдентифкаторТарифа));
	СтруктураJSON.Вставить("startdate",		XMLСтрока(ПараметрыПроцедуры.ДатаНачала));
	СтруктураJSON.Вставить("months",		XMLСтрока(ПараметрыПроцедуры.КоличествоМесяцев));	
	СтруктураJSON.Вставить("count",			XMLСтрока(ПараметрыПроцедуры.Количество));	
	СтруктураJSON.Вставить("email",			XMLСтрока(ПараметрыПроцедуры.АдресПолучателя));    
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_paymentinvoice", СтруктураJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	Если Ответ = Неопределено Тогда  
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	Иначе
		КодСостояния	= Ответ.КодСостояния;
		ТекстСостояния 	= Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния",	КодСостояния);
	СтруктураОтвета.Вставить("ТекстСостояния",	ТекстСостояния);
	
	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезультата);
	
КонецПроцедуры

Процедура ПроверитьПартнера(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(ПараметрыПроцедуры.РегистрационныйНомер));
	СтруктураJSON.Вставить("partnercode",	XMLСтрока(ПараметрыПроцедуры.КодПартнера));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("af_checkpartnerscode", СтруктураJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");   
	Если Ответ = Неопределено Тогда  
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	Иначе
		КодСостояния	= Ответ.КодСостояния;
		ОтветJSON 		= Ответ.ПолучитьТелоКакСтроку();  
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ОтветJSON);  
		
		СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();   
		
		ТекстСостояния  = СтруктураJSON.partnername;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния",			КодСостояния);
	СтруктураОтвета.Вставить("ТекстСостояния",			ТекстСостояния);
	
	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезультата);
	
КонецПроцедуры


Процедура УстановитьПоказыватьРекламуПриСтартеПользователя(ЗначениеФлага, ИмяПользователя = Неопределено) Экспорт

	КлючОбъекта = ВРег("ЛичныйКабинетПоказРекламы");
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "", ЗначениеФлага,, ИмяПользователя);

КонецПроцедуры

Функция ПоказыватьРекламуПриСтартеПользователя(ИмяПользователя = Неопределено) Экспорт

	КлючОбъекта = ВРег("ЛичныйКабинетПоказРекламы");

	Результат = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,"",, ИмяПользователя);
	
	Если ТипЗнч(Результат) <> Тип("Булево") Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьНастройкуПоказаРекламы(ИмяПользователя = Неопределено) Экспорт
	
	КлючОбъекта = ВРег("ЛичныйКабинетПоказРекламы");

	ХранилищеОбщихНастроек.Удалить(КлючОбъекта,"", ИмяПользователя);

	
КонецПроцедуры

//Проверка существовая пользоватея в ЛКК
Процедура ВыполнитьПроверкуСуществованияПользователя(ПараметрыПроцедуры, АдресРезультата) Экспорт  
	
	РезультатПроверки 		= Новый Структура("ПользовательСуществует,ИдентифкаторПользователя", Ложь, Неопределено);
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber", XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("name", 		XMLСтрока(ПараметрыПроцедуры.ЭлектроннаяПочта));
	СтруктураJSON.Вставить("userid", 	XMLСтрока(ПараметрыПроцедуры.ИдентифкаторПользователя));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_checkuser", СтруктураJSON);

	Ответ 		= CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");  
	Если Ответ = Неопределено Тогда
		ВызватьИсключение "Отсутствует интернет-соединение";
	КонецЕсли;  
	
	Если Ответ.КодСостояния = 200 Тогда  
		СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.ПрочитатьHTTPСервисВОбъект(Ответ);
		
		РезультатПроверки.ПользовательСуществует	= XMLЗначение(Тип("Булево"), СтруктураJSON.exists);
		РезультатПроверки.ИдентифкаторПользователя	= XMLЗначение(Тип("УникальныйИдентификатор"), СтруктураJSON.uid);  
	Иначе
		РезультатПроверки.Вставить("ТекстОшибки", 	Ответ.ПолучитьТелоКакСтроку());	
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатПроверки, АдресРезультата);
	
КонецПроцедуры


//Задания отправки
Процедура ПолучитьИнформациюПоЗаданиям(ПараметрыПроцедуры, АдресРезультата) Экспорт   
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber", XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("userid", 	XMLСтрока(ПараметрыПроцедуры.ИдентифкаторПользователя));
	СтруктураJSON.Вставить("master", 	XMLСтрока(ПараметрыПроцедуры.ОсновнойПрофиль));
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_taskssending", СтруктураJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET");   
	Если Ответ = Неопределено Тогда 
		ВызватьИсключение "Отсутствует интернет-соединение";
	КонецЕсли;  
	Если Ответ.КодСостояния <> 200 Тогда 
		ВызватьИсключение Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;  

	ОтветJSON = Ответ.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветJSON);  
	
	МассивJSON = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();   
	
	Результат = Новый Массив;
	
	Для Каждого НастройкиЗадания из МассивJSON Цикл   
	
		Структура = Новый Структура;
		Структура.Вставить("НомерЗадания",			XMLЗначение(Тип("Число"),  НастройкиЗадания.number));
		Структура.Вставить("ИдентификаторЗадания", 	XMLЗначение(Тип("Строка"), НастройкиЗадания.taskid));
		Структура.Вставить("ЧасовойПояс", 			XMLЗначение(Тип("Строка"), НастройкиЗадания.timezone));
		Структура.Вставить("стрДни",				XMLЗначение(Тип("Строка"), НастройкиЗадания.days));
		Структура.Вставить("Используетвся", 		XMLЗначение(Тип("Булево"), НастройкиЗадания.use));
		Структура.Вставить("ДатаНачала", 			XMLЗначение(Тип("Дата"),   НастройкиЗадания.start));
		Структура.Вставить("ВремяНачала", 			XMLЗначение(Тип("Дата"),   НастройкиЗадания.starttime));
		Структура.Вставить("Получатели", 			XMLЗначение(Тип("Строка"), НастройкиЗадания.recipient));
		Структура.Вставить("Копии", 				XMLЗначение(Тип("Строка"), НастройкиЗадания.copy));
		Структура.Вставить("ОтправлятьПакет", 		XMLЗначение(Тип("Булево"), НастройкиЗадания.package)); 
		
		filetemplate = "";
		Если НастройкиЗадания.Свойство("filetemplate") Тогда
			filetemplate = НастройкиЗадания.filetemplate;
		КонецЕсли;
		Структура.Вставить("ШаблонИмениФайла", 		XMLЗначение(Тип("Строка"), filetemplate)); 
		
		
		ТаблицаПрофилей = Новый ТаблицаЗначений;
		ТаблицаПрофилей.Колонки.Добавить("Профиль", 	Новый ОписаниеТипов("Строка"));
		ТаблицаПрофилей.Колонки.Добавить("Статус", Новый ОписаниеТипов("Число")); 
		
		Для Каждого ДанныеПрофиля из НастройкиЗадания.profiles Цикл
			НоваяСтрока = ТаблицаПрофилей.Добавить();
			НоваяСтрока.Профиль	= XMLЗначение(Тип("Строка"), ДанныеПрофиля.id);
			НоваяСтрока.Статус 	= XMLЗначение(Тип("Число"),  ДанныеПрофиля.variant);
		КонецЦикла; 
		
		Структура.Вставить("ТаблицаПрофилей", 		ТаблицаПрофилей);   
				
		Результат.Добавить(Структура);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Процедура ЗаписатьЗаданияОтправки(ПараметрыПроцедуры, АдресРезультата) Экспорт 
	
	РегистрационныйНомер 	 = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	МассивЗаданий = Новый Массив;
	Для Каждого СтрукутраЗадания из ПараметрыПроцедуры.МассивНастроекДляЗаписи Цикл  
		
		СтруктураЗадания = Новый Структура;
		СтруктураЗадания.Вставить("master",		XMLСтрока(СтрукутраЗадания.ОсновнойПрофиль));
		СтруктураЗадания.Вставить("number",		XMLСтрока(СтрукутраЗадания.НомерЗадания));
		СтруктураЗадания.Вставить("taskid",		XMLСтрока(СтрукутраЗадания.ИдентификаторЗадания));
		СтруктураЗадания.Вставить("use",		XMLСтрока(СтрукутраЗадания.Использование));
		СтруктураЗадания.Вставить("start",		XMLСтрока(СтрукутраЗадания.ДатаНачала));
		СтруктураЗадания.Вставить("starttime",	XMLСтрока(СтрукутраЗадания.ВремяНачала));
		СтруктураЗадания.Вставить("days",		XMLСтрока(СтрукутраЗадания.ДниНедели));
		
		СтруктураЗадания.Вставить("recipient",	XMLСтрока(СтрукутраЗадания.Получатели));
		СтруктураЗадания.Вставить("copy",		XMLСтрока(СтрукутраЗадания.Копии));
		СтруктураЗадания.Вставить("package",	XMLСтрока(СтрукутраЗадания.ОтправлятьПакет));  
		
  		СтруктураЗадания.Вставить("filetemplate", XMLСтрока(СтрукутраЗадания.ШаблонИмениФайла));

		МассивПрофилей = Новый Массив;
		//Настройки профилей
		Для Каждого СтрокаНастроек из СтрукутраЗадания.НастройкиПрофилей Цикл	
			СтруктураПрофиля = Новый Структура;
			СтруктураПрофиля.Вставить("id", 		XMLСтрока(СтрокаНастроек.Профиль));
			СтруктураПрофиля.Вставить("variant",	XMLСтрока(СтрокаНастроек.Статус));
			
			МассивПрофилей.Добавить(СтруктураПрофиля);	
		КонецЦикла; 
		//Настройки профилей     
		
		СтруктураЗадания.Вставить("profiles", МассивПрофилей); 
		
		МассивЗаданий.Добавить(СтруктураЗадания);
	КонецЦикла;  
	
	СтруктураJSON = Новый Структура;  
	СтруктураJSON.Вставить("regnumber", XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("userid", 	XMLСтрока(ПараметрыПроцедуры.ИдентифкаторПользователя));
	СтруктураJSON.Вставить("tasks", 	МассивЗаданий);
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_savetasks", СтруктураJSON);
	
	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	Если Ответ = Неопределено Тогда  
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	КонецЕсли;       
	
	СтруктураОтвета = Новый Структура;

	ОтветJSON = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния <> 200 Тогда 
		СтруктураОтвета.Вставить("КодСостояния",	Ответ.КодСостояния);
		СтруктураОтвета.Вставить("Тело",			ОтветJSON);
	КонецЕсли;  
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветJSON);  
	
	МассивJSON = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();   

	Массив = новый Массив;
	Для Каждого НастройкиЗадания из МассивJSON Цикл  
		Структура = новый Структура;
		Структура.Вставить("НомерЗадания",			XMLЗначение(Тип("Строка"), НастройкиЗадания.number));
		Структура.Вставить("ИдентификаторЗадания",	XMLЗначение(Тип("УникальныйИдентификатор"),НастройкиЗадания.id));
		Массив.Добавить(Структура);
	КонецЦикла;  
	
	СтруктураОтвета.Вставить("Задания",			Массив);
	
	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезультата);
	
КонецПроцедуры

Процедура ВыполнитьЗаданиеОтправки(ПараметрыПроцедуры, АдресРезультата) Экспорт 

	РегистрационныйНомер = CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();

	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("taskid", 	XMLСтрока(ПараметрыПроцедуры.ИдентификаторЗадания));  
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("lkk_runtasks", СтруктураJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	Если Ответ = Неопределено Тогда  
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	КонецЕсли;  
	
	Тело = Ответ.ПолучитьТелоКакСтроку();
	
	ПоместитьВоВременноеХранилище(Тело, АдресРезультата);
	
КонецПроцедуры

Функция СериализацияXDTO_JSON(Объект) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
    ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,Объект, НазначениеТипаXML.Явное);
	
	Возврат  ЗаписьJSON.Закрыть();
	
КонецФункции 

Функция СериализацияJSON_XDTO(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		ОбъектXDTO = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	Исключение       
		Возврат Неопределено;	
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();
	
	Возврат ОбъектXDTO;
	
КонецФункции
